{"1528365807490813953":"RT @DrAseemMalhotra: BREAKING:\n\n‘Novak Djokovic’s vaccination stance will show he is on the right side of history’\n\nVia The Sunday Express…","1525174838079504384":"RT @Arwenstar: Getting away from the EU to walk straight into the WHO’s arms is pretty f*cking stupid. It’s also treason.","1525174725600739328":"RT @mikestockmusic: Something odd happened. 2020, the year of the Virus, we had no excess mortality above the 20 year average.\n2021, the ye…","1525173083862073344":"RT @TheBernician: Why was there a referendum over Brexit?\n\nBecause no constitutional changes to UK law can be made without the express cons…","1524852501069045760":"RT @Haystan021: Tweeting won't stop the WHO pandemic treaty.\nA referendum won't stop the WHO pandemic treaty.\nMass non compliance will stop…","1524851625537552403":"RT @Arwenstar: I don’t want a 💉 I don’t want a global pandemic treaty, I don’t want Net Zero policies, I don’t want endless funds sent to U…","1524119998511333384":"RT @_Dr_Who_1: Bill Gates owns the W.H.O. \nBoris Johnson is to join the WHO Pandemic Treaty that supersedes the laws of 194 countries - the…","1524119660186279943":"RT @TomWiboltt: You’re being played Canada!! https://t.co/2tu7t9WM6X","1524118093554806784":"RT @JamesMelville: Boris Johnson is set to join the WHO Pandemic Treaty that supersedes the laws of 194 countries - therefore letting unele…","1524117716277338121":"RT @Togetherdec: Dear @NadineDorries\n\nIf Online Safety Bill goes through, will following topics be \"legal but harmful\" &amp; effectively banned…","1524116993728978944":"RT @JdGreySA: #Pfizer knew https://t.co/yM70z5y063","1524116474096402435":"RT @suzseddon: There are old people sitting at home right now worried &amp; frightened about how they are going to get through the winter,heat…","1524116377946238976":"RT @sophielouisecc: Forget Partygate for a second, the biggest threat we are facing right now is Boris signing that WHO treaty. \n\nHe cannot…","1524113622758219781":"RT @pepelep48542643: We need a referendum on whether we hand our sovereignty to the WHO should there ever be another pandemic.\nWho agrees?","1524113160306933760":"RT @noreward_norisk: ‘There will be other pandemics and other major health emergencies. No single government or multilateral agency can add…","1524112318635950082":"RT @rreactor: The reason #2000Mules is being ghosted by the media &amp; most politicians is obvious. It's true. They have no idea what to do ne…","1524111817768849408":"RT @catturd2: 👏STOP👏GIVING 👏UKRAINE 👏BILLIONS👏","1524111484409856001":"RT @JasonFindlay5: Why is it that unmasked and unvaccinated people are the only ones knowing what's going on?","1524111212375588866":"RT @JamesMelville: Imagine an election where we wiped out Labour and the Tories at the next election and replaced the dysfunctional two par…","1524110944003330050":"RT @PaulMitchell_AB: Millions, including me, are banned from flying, taking a train or leaving the country because of what? https://t.co/WG…","1524110550338256896":"RT @PirroFans: ABSENT from the News \nDominion LOST their law suits against Rudy Giuliani and Sidney Powell.","1524110507057242119":"RT @davidkurten: NO to the WHO Pandemic Preparedness Treaty which will give them power to suspend our constitution of they decide to declar…","1524110389910384642":"RT @MartinKulldorff: By mandating covid recovered staff to be vaccinated, universities and hospitals denied natural immunity from infection…","1524109797037166593":"RT @XrPimpin: Not one political party, major or minor has spoken of the Pfizer document dump.","1524109600869568513":"RT @MattGubba: The WHO pandemic treaty is a dangerous subversion of democracy that must be stopped.\n\nWhat leader in their right mind would…","1524109078573862912":"RT @hairymarx1: @bobscartoons I don't think the proven notorious liars are referring to these graphs and percentages, Bob:\nhttps://t.co/SOc…","1524083694419521536":"RT @accountingetc: The silence from Javid and his crew over vaxxine injuries and deaths, and the reluctance of interviewers to challenge hi…","1524082690718420996":"RT @RealDeniseWelch: Can someone tell me why Bill Gates is the boss of pandemics???!!!!!","1524082350157672454":"RT @respect65: Pfizer, wanted to keep data on their vaccine hidden for 75 years. A court forced them to release the data in batches. Why ar…","1521950417285955585":"RT @EricMMatheny: After two years of “get vaccinated or be banished from society” we’re back to “my body my choice?”","1521949677779922945":"RT @DevorguillaScot: Agenda 2030 is NOT inevitable. Remember, We are many, they are few! Stop complying!","1521948041665814528":"RT @naughtynell101: @DrLoupis This is what I'm trying to figure out. Didn't Matt Hancock say these vaccines were 'Safe and Effective' for p…","1521943359820075014":"RT @trish34139020: Now that the latest 80k @pfizer drug \n document is out, stating that their vaccines have just 12% efficacy in 7 days, ma…","1521943067242205185":"RT @BonnieB18103125: Ok, so there's 650 MP's.\nAre you telling me that one, Sir Christopher Chope is the only one asking for justice for tho…","1521939982600085504":"RT @YardleyShooting: It seems some people's belief in the vaccines is so extreme that they actually deny vaccine injury, effectively gaslig…","1521939817214496768":"RT @William81714480: It bears repeating.\n\nThe Nuremberg Code was put in place to protect our right to choose what medical interventions we…","1521939663388393472":"RT @noreward_norisk: NOT RECOMMENDED for pregnant women. \n\nNOT RECOMMENDED for breast feeding women. \n\nUNKNOWN EFFECTS on fertility. \n\nDidn…","1521931808346099712":"RT @PeterSweden7: Retweet if you agree that unborn babies lives matter👍","1521597388762275841":"RT @KonstantinKisin: I've interviewed good people from both  sides of the abortion argument. I'm glad I don't have to legislate on it.\n\nBUT…","1521595701158981633":"RT @chrislittlewoo8: The UK used its total stockpile of Midazolam (a primary end of life drug) plus an additional 2 years supply of it in j…","1517391194501877762":"RT @KarenH777: It's been over three weeks since the CCP began torturing the 26 million people who live in Shanghai.\n\nNot one single MP has…","1517388701453664256":"RT @AreOhEssEyeEe: Mandates on the unvaccinated are completely against human rights &amp; the $cience when we know that everyone can get &amp; spre…","1517388582964584449":"RT @skakkilaya: In their bid to boost up the booster doses, 'experts' inadvertently accept the fact that COVID vaccines fail to provide ade…","1517388493747539968":"RT @LadySpaulding11: The ask is so simple. Drop the mandates. Live it up, otherwise. Just drop the mandates. They don't work. They're insup…","1517026595516649472":"RT @DrAdamAneevit: One of the biggest unanswered questions of the entire pandemic is \"why aren't the people who didn't get vaccinated or we…","1517026457171681281":"RT @Arwenstar: Zelensky is now interfering in the French election. He has spoken to French channel BMFTV &amp; said Marine Le Pen “is in the wr…","1517025443311935489":"RT @TonyHinton2016: Please don’t tell me wearing a face mask shows you care for other people😷. Wearing a face face mask shows you don’t und…","1517015669082103808":"RT @jonathanlea: The pandemic was not so much about testing for ‘Covid19’ but testing to see what the limits are to most people’s respect f…","1517015582419337216":"RT @firuzimehta: Most of my vaccinated patients are having flare-ups of existing issues to an extent never seen before. It's a struggle to…","1515418580086575106":"RT @respect65: If you have been fully jabbed and still got covid, why are you angry with the unvaccinated?","1515417649601204225":"RT @timfprice: Prediction: both the Conservative and Labour Parties will soon cease to exist. Promoting lockdown in response to a faked pan…","1515397231725195265":"RT @DrAseemMalhotra: Once you understand that the business model of the pharmaceutical industry is fraud and that the big corporate entity…","1515388178596782085":"RT @GarySidley: The politicians &amp; scientists who championed lockdowns, masks &amp; other hugely damaging #COVID19 restrictions must be held to…","1514866779218141186":"RT @WAPFLondon: We don't want @BorisJohnson to apologise for breaking the law, we want him to apologise for making it.","1514723471678488576":"RT @NeilClark66: THEY. WERE. NOT. AFRAID. OF. COVID. WHICH. IS. WHY. THEY. KEPT. HAVING. PARTIES. DURING. LOCKDOWN. \nBUT. THEY. WANTED. US.…","1514721756371726341":"RT @KernowKoth: Whilst you were distracted by Boris’s trip to Kyiv, the UK Gov. quietly published data confirming the Fully Vaccinated acco…","1514721689468297220":"RT @JamesMelville: Boris Johnson is once again hanging the threat of lockdowns over us like the sword of Damacles. He and his government di…","1514721524619620359":"RT @drdavidbull: So let me get this right. The two most powerful politicians in the country are fined for breaking their own Covid rules wh…","1514721173187309572":"RT @Arwenstar: The PM has been fined for illegal gathering and STILL people are totally missing THE point which is not: he broke the rules…","1513811964971163650":"RT @ryanciminski: If you want more people to get vaccinated, maybe you shouldn’t announce you have been infected and have symptoms after FO…","1513811890736148484":"RT @EssexPR: Dear NHS Confederation,\nI won’t be wearing a mask and I won’t be limiting my indoor mixing or anything else.\n\nYour calls for s…","1513811770372247553":"RT @gazcon: You must make sacrifices to beat Covid.\n\nYou must make sacrifices to beat climate change.\n\nYou must make sacrifices to beat Put…","1513759205559312384":"RT @ZoePrecious2020: I had COVID symptoms last week.\n\nThankfully I had relatively mild symptoms and was only unwell for 1 day.\n\nI am sure i…","1513759113150451713":"RT @Bel_B30: Two things I've noticed...\n\nThe triple jabbed are still terrified.\nThe unjabbed aren't getting ill.","1513759074076307460":"RT @JamesMelville: If you still think that a Zero Covid strategy is the right thing to do, go and look at what is happening in Shanghai rig…","1513759016945696773":"RT @miss_anthrop75: I definitely think the British mentality is “but our government wouldn’t do THAT to us...”\n\nI don’t know whether to lau…","1513758547200417795":"RT @DrCharlesL: Adult antibody coverage is at an estimated 98.8% in England (ONS).\n\nCalls for more restrictions are wrong. We would be in a…","1513753035767529479":"RT @LydiaNusbaum: I got TIRED of mainstream media so I QUIT my job as a TV news reporter.\n\nI’m now joining the conservative journalists at…","1513532414605340675":"RT @curmudgeon672: @sajidjavid You've got some cheek. You wanted to sack unvaccinated nurses. We won't forget that.","1513529305783013376":"RT @DouglasKMurray: There is no such thing as a ‘trans child’.","1513525768390852610":"RT @emmakennytv: ‘Experts’ now talking about the calamity of lockdowns and the negative impact measures  had on EVERYTHING….a LOT too late…","1513524943396524038":"@IainGordon2 @tag970 @Master_Bucks @SammieJack3 It was necessary to get the population to believe in asymptomatic transmission so they would make statements like this.  If you have enough of a respiratory virus to be able to pass it on, you will have symptoms.","1513207089237270535":"RT @AndyL47721930: #bbcnews Johnson is now in Ukraine visiting Zelensky, would a PM go to a place in the middle of a war, people really nee…","1507621151719276544":"RT @JamesMelville: So today I’m going all old school and will go into the bank and withdraw some actual real cash that I will spend over th…","1507620993925324806":"RT @AnnaSPhilipps: How is it not bigger news that Zelensky banned his opposition parties and absorbed the free press into state media?","1507620957237751809":"RT @RWTaylors: If you called for lockdowns then don’t complain about the cost of living, you were culpable.","1507617748716822530":"RT @sharrond62: Males have between a 10-30% advantage in sport. Punch 160% harder lb for lb. No reduction in testosterone removes all male…","1507617603296108548":"RT @sharrond62: Sport is exclusionary by definition to create fair play. 15 yr olds don’t get to  race with the 10yr olds. Several classifi…","1504164042591592456":"RT @crimlawuk: 94.34% of criminal barristers have voted to take action against the government's destruction of the criminal justice system.…","1504163676449824769":"RT @YardleyShooting: I am surprised at the lack of combat footage coming out of Ukraine. MSM, meantime, re-uses so much of the same materia…","1500470579916414977":"RT @KathyConWom: Gavin Williamson - given a knighthood?\n\nIf he had any decency he would refuse. \n\nChildren starved in lockdown. \nChildren a…","1500470449427386368":"RT @RogerMarshallMD: RT if you want the Senate to terminate the COVID-19 national emergency declaration today!","1500470249828855811":"RT @Arwenstar: As far as I’m concerned there’s one very clear enemy, one very obvious ‘baddy’, one terrible entity, and that’s the WEF.","1500469179752849409":"RT @JuliaHB1: Count me in.","1500468964627034119":"RT @AVIHouseParty: There’s a pub in Manchester City centre I’ve been in tonight, cash only. Signs saying say no to digital. Everyone I spok…","1499854846995963905":"RT @DrAseemMalhotra: Speechless. There is no way that the medical profession have made this decision. Must be political","1499854299286880256":"RT @HumanRights4UK: 💉 To every person who was concerned the product was: rushed to market, wasn't fully tested, wasn't safe, had no long-te…","1499159654424850435":"RT @YvetteCurtis59: Please can we concentrate on what’s happening at home here in the UK instead of  being distracted elsewhere.  We must n…","1498973060216590339":"RT @FrancisBoulle: It is possible not to blindly swallow a narrative being fed to us by a media/political class with a proven pattern of di…","1498972981443411968":"RT @AuntyVaccine: Who remembers the Ozone/climate crisis that never materialised. Who remembers the millennium bug catastrophe that never w…","1498613082091884545":"RT @TomM71190988: In the time of JT, we have lost confidence in most of our institutions, banks,  education,  medicine,  law, police, gov e…","1498318040449961985":"RT @DrAseemMalhotra: The FDA is on the payroll of the industry it regulates. Think about that. REALLY think about it.","1498317713562812422":"RT @PaulMitchell_AB: When will unvaccinated Canadian citizens be allowed to freely leave the country and travel @JustinTrudeau?\n\nHow much l…","1498184474277912576":"RT @NickPye10: Resist all attempts at digital health systems.","1498184401133445121":"RT @wytewzrdz: I love whenever restrictions get lifted, we're suddenly bombarded with \"Please respect our choice to wear a mask\". Oh sudden…","1498184332036476930":"RT @RogerHelmerMEP: The Earth’s biosphere has survived and prospered for ~3 billion years, through large temperature changes from Arctic to…","1498183959955521537":"RT @GillianMcKeith: After two years of being bombarded with untruths.... we are supposed to believe everything that’s being thrown at us no…","1498183843010027525":"RT @GarretKramer: We focus on a virus. We focus on war. And in the background, the basis of ill-health and conflict builds: The planet is c…","1498183762680684545":"RT @TheConservati19: Scott Morrison saying this morning that Ukranians should be able to live their lives in freedom? free from intimidatio…","1498179856986746881":"RT @DrAseemMalhotra: It all makes sense now &amp; it’s very liberating to have clarity. Sadly the truth is really, REALLY ugly and therefore mu…","1497704733154299904":"RT @KevinKileyCA: Today Gavin Newsom announced the State of Emergency will remain in place for the \"endemic\" phase. This is blatantly illeg…","1497649867073728522":"RT @AlecHopkins6: The BBC are reporting on protests in over 50 Russian cities overnight, yet they failed to notice 1 million people protest…","1496598863184019477":"RT @PeterSweden7: Retweet if you think people shouldn't have to show their papers to be allowed to live a normal life.","1496219948938633221":"RT @Arwenstar: For the “greater good” we need to get rid of the WEF and everyone associated with it. For the greater good.","1496219908534898697":"RT @rick_pittman: Freezing someones bank account prevents them from buying the necessities of life such as groceries or medications. For an…","1495319400144113667":"RT @NickPye10: Apart from Jacinda perhaps is there a more evil leader of a nation? Any nation.","1495319286528815105":"RT @1Pr0p0rt10n2: Scottish data was a treasure trove of good information showing the true performance of the vaccine. That's why they are c…","1494636443381207051":"RT @chrislittlewoo8: UK Government’s latest jab sales promotion.\n\nLet’s jab 5-11 year olds.\n\nIt won’t do them any good.\n\nSome will die &amp; lo…","1494635040348778497":"RT @JohannaSurgeon: https://t.co/1sHiODy2O7 why is this being framed as parental choice? We recommend vaccination or other medical treatmen…","1494634801025978389":"RT @DrTinaPeers: We need to urgently investigate ONS safety data which shows unexplained rise in all-cause mortality in 15-19 year old male…","1494634722647019542":"RT @mislavkolakusic: Covid passes around the world were introduced by the dumbest generation of politicians in history. Driven by a desire…","1494634319402438674":"RT @TonyHinton2016: Sweden decides against recommending COVID vaccines for kids aged 5-11. Once again Sweden makes the right decision. http…","1494633276908179474":"RT @Leftylockdowns1: The other day Paul Offit, among the most zealous vaccine advocates in the nation, described the meeting at which CDC d…","1494632465511690245":"RT @JohnBoweActor: @ControlGroup10 @ai_clayton Yes. There’s a comprehensive toxicology report, from a reputable UK lab, on several of the C…","1494632398964858880":"RT @SIMONrun: @BBCNews The fact that millions are \"unvaxed\" suggests they're doing just fine...","1494629350926434308":"RT @lucylocket1700: Has Boris condemned Justin Trudeau's implementation of Martial Law yet?\nIf not why not?","1494283921973989377":"RT @ezralevant: RETWEET if you notice that the Media Party is putting far more energy and aggression into scrutinizing the donors to the tr…","1494282827726266370":"RT @_ReviveYourself: Monsanto said Round Up was safe\n\nThe drug companies said Thalidomide was safe\n\nTobacco companies said Cigarettes were…","1494061973008433168":"RT @apsmunro: There has been a surge in misinformation about children and #COVID19 recently\n\nIt can be confusing and worrying for families…","1494060908078940161":"RT @ianmSC: With some of the harshest restrictions on earth — N95 mandates, strict vaccine passports &amp; lockdowns for the unvaccinated, Aust…","1494059458015768578":"RT @LanceForman: It's so bloody windy this evening.  \n\nThe wind-turbine electricity companies should be giving us all a refund!  \n\nExcept t…","1494056235838193673":"RT @Mikenotsoyeadon: We've been led to believe the UK have seen 156,924 deaths due to the rona, but it was in fact 6,183, with the average…","1494055061202341888":"RT @stephen_taylor: Do you agree that Justin Trudeau has lost the moral authority to govern?","1494054830029090816":"RT @HowardSteen4: The Canadian truckers can win and most likely will win if they hold the line for another week or so. https://t.co/eNCcFKw…","1494053788193275904":"RT @TheRealKeean: Any use of military equipment, tools, or personnel constitutes an attack on unarmed Canadian civilians. If this happens,…","1494051703406182407":"RT @DrAseemMalhotra: 💪💪💪","1494051223015731209":"RT @TheRealKeean: Foreign governments should immediately sanction Justin Trudeau, his family, and cabinet Ministers who are facilitating th…","1494050863949787145":"RT @AllisonPearson: Just told my friend with a six-year-old and a nine-year-old to promise me she won’t get the kids vaccinated. \n “No way!…","1494050530095771648":"RT @BernieSpofforth: FRANCE - 5 million un boosted citizens are considered unvaccinated and will lose all societal freedoms, including the…","1494048497276014610":"RT @paulrtrotman: So, in the Lancet. People who have built up natural immunity to Covid-19, are ten times less likely to be re-infected. An…","1494047600445636608":"RT @DineenRon: I am triple vaccinated and more left than right on the political spectrum. Something is severely off with these Covid vaccin…","1494047238716284933":"RT @tarynabell: The NHS were threatening to sack thousands of staff for not wanting a jab that can cause damage.\n\nThey’re now advertising j…","1494045835818061831":"RT @DrAseemMalhotra: THIS","1493721746347802626":"RT @WikiLeaksUS: Vladimir Putin called Justin Trudeau a tyrant. 😏","1493721576378073089":"RT @mislavkolakusic: The intention of 🇨🇦PM Trudeau to freeze the bank accounts of citizens who oppose his insane measures without a court o…","1493719880335601672":"RT @nealyboy73: Dear Prime Minister .@BorisJohnson, you've made your thoughts clear about Russia's President Putin on Twitter recently. Wil…","1493719038249340928":"RT @jamie_blom: We are here https://t.co/OoDzVwrIzd","1493718949015474177":"RT @ArchRose90: Justin Trudeau, he has lost it hasn’t he?","1493718903536640003":"RT @GarretKramer: Where is the evidence that those who decline a Covid injection are a danger to themselves and others? My friends, family,…","1493718849673469952":"RT @IsabelOakeshott: Net zero will cost the UK hundreds of billions and affect every single one of us. Shouldn't we asked whether this is w…","1493718385993080837":"RT @PaulMitchell_AB: Trudeau allowed ISIS fighters to return to Canada, but he wants to use terrorism financing legislation to freeze the b…","1493717666812637184":"RT @JohnBoweActor: Ottawa Police Chief resigns. COME ONNNN!! Onwards! #CanadaTruckers #OttawaPolice #CanadaTruckers2022 #Canada   The whole…","1493717616501919746":"RT @GhostofRealBen: We need a general strike in Canada ASAP. Every single working person needs to just stop and bring this entire thing to…","1493717049612414982":"RT @liz_churchill_: Pay attention…not one Western Leader has condemned the actions of Trudeau.","1493716937943273480":"RT @CarlaHSands: Justin Trudeau just invoked martial law on his people over a peaceful protest. \n\nThis isn’t what a free country does to it…","1493715578175037442":"RT @BeverlyHallberg: Today I’m not allowed to eat in DC. Tomorrow I am. Because science.","1493714906369167365":"RT @leezeldin: ALL COVID mandates must end NOW! RT if you agree!","1493714004312825859":"RT @drsdelliscc: Today, I will be voting in favour of our Conservative Opposition Day Motion calling on the government to table a plan for…","1493713835110416385":"RT @KellyMartin_UK: IMPORTANT NEWS: U.S. German Attorney Dr. Reiner Fuellmich gives additional remarks about the Gand Jury Investigation. W…","1493703936984952832":"RT @KarenH777: As a child I received extensive Holocaust education, like most Jewish children. I always wondered how supposedly civilised p…","1493703885139189764":"RT @pepelep48542643: I’ve removed myself from the Donor Register until such time that all travel restrictions are lifted for the unjabbed.…","1493593268252291080":"RT @greeneyedmum: We MUST abolish the WEF now! We do not want or need their agendas!","1493590763577483265":"RT @johndefeo: Tonight, 70,000 maskless adults are shoulder to shoulder, enjoying life together in California.\n\nTomorrow, approximately 7,0…","1493590579732746241":"RT @mislavkolakusic: In my speech in the EP, I warned about the emergence of a powerful, unscrupulous mafia-pandemic profiteers who, with t…","1493590421414547457":"RT @JackPosobiec: BREAKING: DC to drop vaccine mandates effective tomorrow","1493590123719573507":"RT @DrThompson22: A kid my sister looks after lost his dad today. A heart attack. Only 35 and a runner, 3 days after his booster. \n\nKeep sp…","1493589406162333703":"RT @NLeespeaking: How many times does it need to be pointed out that “Deaths *for any reason* within 28 days of a positive test” is a wholl…","1493588884596432898":"RT @SailAwayOnBlue: The unjabbed have done more research than the jabbed.\nThat's the tweet.","1493588703385731072":"RT @DrAseemMalhotra: This will prove to be one of the most pivotal moments in the history of medicine.","1493587541550850050":"RT @ExCensorshipose: 🚨| BREAKING: Member of Parliament confirms the police have launched a criminal investigation into the UK’s rollout of…","1493585911745069061":"RT @NickPye10: I won’t need an HIV test, because I haven't had a COVID jab.","1493585654424473600":"RT @Dr_M_Skinner: Sajid Javid decided that sacking unvaccinated NHS staff was disproportionate and he plans to revoke the vaccine mandate,…","1493584854885228549":"RT @crimlawuk: Boris Johnson is paying a lawyer to find a loophole to escape from a law which Boris Johnson made up.","1493584296719826945":"RT @DrAseemMalhotra: Wake up people. WAKE UP","1493285829262860295":"RT @HegKong: Thalidomide was released in the late 1950s but it was not up until 1961, and after causing more than 10,000 severe birth defec…","1493285042415710210":"RT @MaidmentRos: MPs and doctors call for a halt to vaccination of under 16s pending a full investigation of the current balance of benefit…","1493276312559050762":"RT @Ayaan: So, what do you think of Joe Rogan?\nLots of hand wringing going on.\nMy take: he is a good guy. A great man.\nHe is NOT a racist.…","1493276186260250636":"RT @slight_defect: In my humble opinion, simply ending the mandates now isn’t good enough. We need trials.","1493275625968308230":"RT @lensiseethrough: Weaponisation of parents in the collusion of harm against their children - masks, testing, isolations - was a rubicon…","1493274824470315011":"RT @Arwenstar: Amnesty International choosing Trudeau over the Truckers tells you everything you need to know about the state of human righ…","1493272603917697027":"RT @MartinKulldorff: The denial of natural immunity after Covid disease is the worst unscientific folly in the past 75 years. How will univ…","1493271797688582149":"RT @ksorbs: Bill Gates:  The same person who says the world is overpopulated wants to save your life with a vaccine.","1493271475939389444":"RT @CarlaHSands: Vaccine passports don’t belong in a free country.","1493271411082809344":"RT @KellyMartin_UK: @sajidjavid Total discrimination when many jabbed are ill with Covid and there is no difference between them catching i…","1493270051872518146":"RT @noonienoodie: The nursing home I was fired from, for declining the jab, is currently going through a huge outbreak. Several residents &amp;…","1493269760615854088":"RT @jlo_said: **MADEIRA Covid Travel Update ** From #Madeira 14/2 ❤️ #Madeira welcomes all UK travellers regardless of vaccination status a…","1490382868350226439":"RT @AnneMccallie: Former Blackrock exec says that if Pfizer and the FDA refuse to release all data on V* clinical trials, then he will assu…","1489978775274205191":"RT @JJMcNallyCo: We are delighted to note that the Department of Health have formally confirmed, through their solicitors, that their #COVI…","1487790792701788164":"RT @lensiseethrough: The scenes from Canada are incredible - a triumph of humanity over darkness.\n\nHow can they not be getting across-the-b…","1487790270796247041":"RT @johnthe92611772: Ask yourself this question.\n\nIf the media and Gov hadn't told you that there was a deadly virus.\n\nWould you have reali…","1487790175677779970":"RT @LClare51: My parents just phoned my dad has covid. They went out with friends last Tuesday, all triple jabbed, 7 out of 8 have now test…","1487789838841565184":"RT @DrAseemMalhotra: The mainstream media is LYING to you","1486415656320962568":"RT @Resist_05: How did we allow them to succeed in demonising coughs and sniffles.. but normalise heart inflammation, myocarditis and heart…","1484115134549221379":"RT @jonathanlea: It’s terrifying that most people are not in uproar that those who haven’t had the latest injections should be stripped of…","1484114990877786115":"RT @ajlamesa: Norway, Denmark, and Sweden all have social democratic governments. Masks are not required in any of their child care facilit…","1484064414164824064":"RT @TheMarcitect: I think most people are only watching the Australian Open to see how many athletes drop from heart attacks on the court.…","1484063677288529922":"RT @screenname87: My vaccine strategy was to wait for the clinical trial to end and assess the benefits Vs risks at that point.\n\nEverything…","1483482601927102465":"RT @DrCharlesL: Omicron was not nearly as severe as some feared, thankfully.\n\nI hope it serves as a lesson to some not to focus solely on t…","1483002750615052288":"RT @DrAseemMalhotra: My biggest fear now is that it’s going to get violent. When the truth comes out we must do all we can to stop that &amp; s…","1483002657283493893":"RT @emmakennytv: TOTAL deaths in England &amp; Wales from COVID-19 with NO OTHER UNDERLYING CAUSES\n\n17,371. Every death is a tragedy but it’s t…","1483001080724213764":"RT @EssexPR: A little reminder, some of those unvaccinated NHS workers have been exposed to or been around Covid many of the days they’ve w…","1483000628494405636":"RT @cotterill_david: • Footballers heart attacks up 300% in 2021\n\n• Sporting people who are vaccinated are 6-7 times more likely to have a…","1483000526170173441":"RT @geezerpaulr: If the unvaccinated healthcare staff are such a risk to patients how comes they are ok to work until April? Why have they…","1483000442154106880":"RT @EssexPR: I haven’t met a single person that would want Michael Gove as the next PM.\n\nNot one.","1483000105665974274":"RT @lensiseethrough: I'll be on @JuliaHB1 @talkRADIO 9:45am talking about why @UsforThemUK have reluctantly decided we need to take @nadhim…","1482999867005968385":"RT @AgreeT0D1sagree: I always fancied going to Australia but I’d rather go to fvcking North Korea now! \n\nAt least they’re openly a totalita…","1482999824509243394":"RT @ollie_harfield: The increase in healthy athletes collapsing all over the world is not a conspiracy theory…\n\nWhy such an uncomfortable c…","1482999344978608129":"RT @YardleyShooting: What exactly are they vaccinating people against now? If we continue with boosters for what is effectively a cold, the…","1482999283200806914":"RT @NickAdamsinUSA: RT if you stand with Novak Djokovic!","1482029555514806278":"RT @MattGubba: The Government are reeling right now and are starting to backtrack on restrictions. \n\nThey know they've lost the public.\n\nBu…","1482028051168911360":"RT @johnredwood: I cannot understand why the very government officials who were imposing rules on the rest of us and telling us to obey the…","1478855861175037955":"RT @fionamflanagan1: The unvaccinated are a dehumanised &amp; persecuted minority. Recent comments made by Trudeau &amp; Macron were dangerous &amp; di…","1478855125204615173":"RT @culturaldude: If anybody is in any doubt that we should live with the virus, Starmer is isolating for the SIXTH time even though he is…","1478854303951429632":"@SwaleMatt I and 4 members of my family have all had blood tests following our request to our GP.  All have antibodies (mine after 21 months).  Natural immunity!!","1478852521326219268":"RT @lensiseethrough: This obsession with transmission in the context of a fully vaccinated adult population and a mild virus is cowardly an…","1478852437385621505":"RT @KirstieMAllsopp: There is now ZERO justification for testing requirements for travellers, either PCR on arrival or antigen before depar…","1478851984199409670":"RT @JamesMelville: Self-isolation for mild cold symptoms or no symptoms or being pinged on an app to self isolate because someone else had…","1478849688933646340":"RT @wrysmile9: @MaajidNawaz @ArthurCaplan There is no “do the right thing” about joining a Phase III trial of a mRNA gene therapy jab, wher…","1478849454245560320":"RT @ComradeVero: Question. 🙋🏼‍♀️\n\nHow many jabs do you need to take to make the first two work? 🤔","1478849338826797064":"RT @GNev2: So @Twitter has permanently banned @politicsforall . A very dark move. What the hell is going on? \n\n#ReinstatePoliticsForAll","1478849166147211264":"RT @mercola: Agree? https://t.co/gX2vBxrO7Y","1478849005543116811":"RT @DPJHodges: Genuine question re-Starmer. What are the chances of getting Covid twice in the space of two months, having been doubled jab…","1478846048521097222":"RT @YardleyShooting: They can't keep this going much longer without more people catching on.","1478845524551913472":"RT @mallondavid1: @MAbsoud My oldest will remember missing school much more than being afraid of Covid-19","1478845222503206923":"RT @ProfKarolSikora: The debate has moved on, but with what we know now about Omicron, vaccine passports need scrapping.\n\nVaccinated people…","1478845011672375303":"RT @TheFreds: 2 jabs + 1 booster and my mate has tested positive. Live like this if you want to but don’t expect the rest of us to be so gu…","1478844920857309191":"RT @paulfrewDUP: The Health Minister should move to scrap vaccine certification immediately. With rising cases it just goes to show that it…","1478844802020036609":"RT @AvonandsomerRob: Ever played that game where you have to guess how many of something there are, and if you are within a certain limit y…","1478037174863859719":"RT @PN_1984: Asymptomatic = healthy\nAsymptomatic ‘cases’ = false positive test result\n \nClear enough for the slow folks out there?","1478037070320910345":"RT @mrmarkdolan: If you are comfortable with children as young as 12 wearing a face covering ALL DAY LONG in the classroom, not only do you…","1478034021863104518":"RT @emmakennytv: This!!! Keep it going #MassPsychosis","1478033783014281220":"RT @TonyHinton2016: New Covid restrictions unlikely as daily cases fall, ministers signal https://t.co/5hNmRe2t9R All legal restrictions sh…","1478032302919794688":"RT @1MikeFairclough: \"Plans to force children to wear face masks in secondary schools were hit by a backlash on Sunday night as figures sho…","1478032070639337481":"RT @Fox_Claire: Just possibly, sense of proportion needed:\"Official figures reveal that a SINGLE patient has required intensive care from t…","1478031771631505411":"RT @DrAseemMalhotra: Good grief. You REALLY couldn’t make this up","1478031616802971660":"RT @BreesAnna: Sky News say here very clearly that those who are double vaccinated have little or no protection from omicron. https://t.co/…","1478030985899958278":"RT @Resist_05: Amsterdam.. this is absolutely epic.. this is a revolution.! \n\nRESIST 🔥❤️🔥 https://t.co/WpL3HQ5luT","1478030772141494273":"RT @SausageIzzy: Court rules only 152 died of COVID-19 in Portugal, not 17,000","1478030698846035969":"RT @GarySidley: So we have SAGE scientists compromised by drug-company/Gates foundation moneys, MSM dependent upon finance from Government…","1478020836888137732":"RT @GillianMcKeith: We will not be censored. We will not live under communist, authoritarian rule. We will not be silenced.  We will not be…","1478020148099485705":"RT @AllisonPearson: Kids have been wearing masks in Scotland, Wales, Northern Ireland. It seems to have made things worse. Well, well…","1478019765084073987":"RT @AllysonPollock: Stay at home if you have respiratory symptoms.  This simple, cheap message covers lots of respiratory viruses including…","1478018991847264257":"RT @CrimsonCode1: The truth has taken root - finally\n\nThey can't shift this or change it, so are awkwardly having to accept it. Hence a flu…","1478018851828899841":"RT @northerness: I'm amazed how governments all over the world continue to get away with the Great Mask Lie.","1478018060569169925":"RT @TonyHinton2016: Face masks in secondary schools is not the law only guidance. No evidence face masks work. Many harms. Does anyone cons…","1478017575737036806":"RT @org_scp: First week of January &amp; the energy of pushback from citizens is fantastic. The gloves need to stay off. Go hard &amp; go early.…","1478017470539747329":"RT @CerebralWisdom: Men become civilized, not in proportion to their willingness to believe, but in their readiness to doubt. - H. L. Menck…","1478017187042545665":"RT @PeterDClack: Its now official. Global warming is over. All measures for 10 to 15 years show no temperature increase, a fact ignored by…","1478016842451017737":"RT @johnredwood: The US President and the EU are rowing back on their COP 26 promises and are out to produce,buy and use more gas. The U.K.…","1478016234453094404":"RT @ErrolWebber: If you still need a booster after being fully vaxxed… and still need to get tested after being fully vaxxed… and still nee…","1478016067331055620":"RT @realchasegeiser: The reason twitter shut down MTG for sharing VAERS data is Reuters does the Twitter censorship and the Chairman of Reu…","1478015399761428482":"RT @ccdeditor: New Year's Resolution: Fight The Climate Doomsters While We Still Can https://t.co/3KD3NbWyuB","1478013507195088897":"RT @SikhForTruth: Bosnia becomes first country in Europe without COVID pass.\n\nLawyer Mirnes Ajanović defeats government legislation to take…","1478012882684194820":"RT @Michaelmclucki2: @ToniaBuxton https://t.co/Pw5EwYOfui","1477655058359721986":"RT @fly_girl7: If you're bringing in the New Year unvaccinated and unafraid, Give me a Like and Retweet so I can Follow you.","1476977852121812994":"RT @IamStevacus: Unvaccinated in Italy are sentenced to an indefinite term in digital prison. Only allowed out to grocery shop, exercise, a…","1476977603592572930":"RT @susanastubbs: Have you or do you know someone personally that used to be healthy but suffered one or more of the following things after…","1476977315909451776":"RT @EzraKahan: Why does nobody care about my immunity status ?\n\nAll they care about is vax status.","1476975799114907650":"RT @Milhouse_Van_Ho: The lockdowns never worked. \n\nThe masks never worked.\n\nThe vaccine passports never worked.\n\nThe vaccine mandates never…","1476974447160705032":"RT @GarretKramer: Out health “experts” say that the “variants” are the problem and then beg you to get boosters of a computer sequence that…","1476972686748405761":"RT @GavChambers2: Do we need further lockdown measures to stop the spread of Omicron Virus ? ( Retweet for maximum results)","1476972419214630923":"RT @PeterDClack: No media coverage at all has been given to one of the mildest Australian summers in memory. The occasional warm summer's d…","1476972315309228033":"RT @jburnmurdoch: If anyone says the UK’s 332 reported Covid deaths today are due to the Omicron surge*, that’s a useful sign that you can…","1476971545423663113":"RT @culturaldude: 2021 - the year of lies\n2022 - the year of exposure\n\nTrust me.","1476970594432335877":"RT @dalebloomfield3: Found out today I have a blood clot In my leg thanks Covid booster 🤝","1476970528778948613":"RT @PaulMitchell_AB: “Vaccine Passports” for a ‘vaccine’ that doesn’t prevent transmission or infection is the dumbest concept imaginable.…","1476970460327944194":"RT @RWranglebury: 2400 comments and we see the same themes repeated.\nPeople are concerned about their health and Government overreach. \n\nNo…","1476970044756307969":"RT @MyProfileIsHere: i.e. The CDC is now admitting that the PCR test cannot differentiate between SARS-CoV-2 &amp; influenza viruses &amp; never co…","1476969979253772299":"RT @wendywoo6089: My friend is an unjabbed nurse who is working exceptionally hard at the moment due to so many of her jabbed colleagues be…","1476967563053740033":"RT @DrJBhattacharya: Throughout the pandemic, the 'expert' class has successfully pushed the idea that in order to avoid future lockdowns,…","1476967379276029957":"RT @ArmyofShadows2: The British government and state have broken the social contract and any sense of reciprocity. They are an occupying fo…","1476967061519749126":"RT @PamLongCO: 🍿 Watching the CDC implode as it announces sick triple-vaxxed healthcare workers can work with mild symptoms (after terminat…","1476966789208752138":"RT @cjsnowdon: There is a particular type of male midwit on here who is determined to defend Covid modelling no matter how demonstrably bad…","1476966582651863041":"RT @KathyConWom: This is courage.","1476966396751925254":"RT @ElaineK35265537: If there was a general election next year, which party would you vote for? Please retweet for wider opinions!","1476965578053193728":"RT @MaajidNawaz: Two months before his @Twitter account got banned. \n#ReinstateRobertMalone \n#RESIST https://t.co/grmUdLXgEc","1476965439435685889":"RT @PaulMitchell_AB: Are we still \"following the science\" when the Robert W. Malone, inventor of mRNA technology, is banned for talking abo…","1476965331029700611":"RT @AllisonPearson: Ghislaine Maxwell guilty of procuring girls to keep Epstein sated.\n Clearly the right verdict.\n Now how about all those…","1476965276621197312":"RT @lensiseethrough: Tying education to the edifice of testing was always a blinkered  strategy, as so many of us tried to warn at the time…","1476964869480103940":"RT @JohnBoweActor: Our biggest disappointment of the last two years is how stupid and easily led many of our politicians are. I do believe…","1476954545628528640":"RT @Kingbingo_: Future historians will eventually agree that taking Vitamin D, Outdoor Exercise, Weight loss and Ivermectin were all the co…","1476953963341754370":"RT @solari_the: https://t.co/mh1Qf9K8HU","1476952565493415943":"RT @ksorbs: The situation in Australia would be much worse if the world wasn’t watching.","1476952480974057473":"RT @lwhelpy: So the PCR test that’s been used all along was never fit for purpose and will not be approved for use in the US after tomorrow…","1476948264788369411":"RT @jordanbpeterson: Use of fear to control behaviour in Covid crisis was ‘totalitarian’, admit scientists https://t.co/W3asqmarQi","1476947720451592205":"RT @MdTeryn: It’s clear: natural immunity is the ONLY immunity","1476947160755326985":"RT @PeterSweden7: JUST IN - Italy is BANNING the unvaccinated from:\n\n- Trains\n- Planes\n- Busses\n- Ships\n- Hotels\n- Ski lifts\n- Outdoor rest…","1476639161247580173":"RT @Togetherdec: NHS Physio for 32 years: \n\n\"In the 2 small teams I work in, 4 of my vaccinated colleagues all got covid. How are they safe…","1476256115461705731":"RT @damian_from: RT if you think @JeremyCorbyn would have been a better prime minister than @BorisJohnson","1476252685171109890":"RT @stacey_rudin: “The world will not be destroyed by those who do evil, but by those who watch them without doing anything.”\n—Albert Einst…","1476202252369113093":"RT @TonyH091963: 👇 Sometimes you can be a bit toooo keen to 'over egg the pudding' and end up looking like a cheap snakeoil salesman.\n\nIt w…","1476202091324612610":"RT @MaajidNawaz: https://t.co/6tUckMdBSt","1475853855200055299":"RT @MAbsoud: Omicron has shown us that sChOoLs being the main drivers of transmission— \n\nas probably the biggest myth of pandemic","1475853507144077316":"RT @RealCandaceO: Over the last 3 weeks I know seven people who came down with Covid. Zero of them were vaccinated. Zero of them went to th…","1475853353129287687":"RT @northerness: I get the feeling that everything is unravelling now. 👍","1475853043518345216":"RT @fionamflanagan1: We were lied to about 2 weeks to flatten the curve\nWe were lied to about facemasks\nWe were lied to about cases\nWe were…","1475853004767211527":"RT @JamesMelville: Meanwhile in South Africa 🇿🇦 &amp; UK 🇬🇧 https://t.co/UvineOxkfa","1475852666043568129":"RT @AnnadeBuisseret: “We hold these truths self-evident, that all men are created equal, that they are endowed by their Creator with certai…","1475852593951907850":"RT @youth_unheard: It’s scary how short the memory span of the general population is. They have no recollection of the many, many changes o…","1475852540709588993":"RT @stacey_rudin: Months ago, we were past $17 trillion spent on the pandemic. Imagine how far that could have gone to clean up the oceans.…","1475852404973264904":"RT @ZubyMusic: A lot of people deserve to be in prison and/or hell after what they've done to millions over the last 2 years.","1475851903472910336":"RT @AnnadeBuisseret: “We the Peoples of the United Nations.. reaffirm faith in fundamental human rights, in the dignity and worth of the hu…","1475850654279254016":"RT @profnfenton: From table 1b of the recently released ONS survey on the Omicron variant. Of those testing positive with Covid, the probab…","1475849878639104000":"RT @lensiseethrough: Hmmm. Isn’t this fraud?","1475849129372880898":"RT @BareReality: \"Do as you're told, or we'll make you.\" This is not informed consent.","1475848852070715403":"RT @RichardWellings: The government is building a police state in which biometric digital IDs will be required to access jobs, housing and…","1475847299263832069":"RT @ExogenesisHH: I'm asking all the people with the unnecessary mask profile pictures to play a small part in returning things to normal,…","1475837606843854852":"RT @johnredwood: The U.K. government blocks new oil and gas production at home. President Biden hands out 3091 drilling permits in his firs…","1475837204039614470":"RT @nick_the_geek78: NHS: \"every adult needs a booster jab against omicron\".\n\nNew York Times editor Carlos Tejada (49) suffered a heart str…","1475836814393057281":"RT @LockdownLazarus: I know the jab is at best pointless and at worst bloody dangerous. But the main reason I won’t take it is I refuse to…","1475836235964993546":"RT @AllysonPollock: The virus is endemic- vaccines do not stop transmission or disease and eventually most people will get covid -  vaccine…","1475817964750491652":"RT @ajlamesa: If you claim you wanted schools to be safe enough to open, but set impossible safety standards for them to open, you didn’t r…","1475817631840149507":"RT @AnnadeBuisseret: I predict a tsunami of arrests in 2022. \n\nAll those who are participants in these crimes against humanity, genocide, d…","1475590418536574985":"RT @jonathanlea: https://t.co/IsMrPwR39A","1475590272839036929":"RT @EssexPR: There is NO case for restricting us again. Enough is Enough.\n\n@GOVUK @BorisJohnson @sajidjavid","1475590024162910216":"RT @timfprice: *The reckoning to come is going to be truly biblical.","1475589876317933572":"RT @CrimsonCode1: This is the 'end game', it's either them or us. \n\nThere's been a mass awakening as they've pushed their agenda too hard a…","1475589729131372548":"RT @MontagueTerrie: Still unvaccinated and still healthy and happy... 😉👌❤","1475589705660051457":"RT @JamesMelville: Don't comply with bad rules from bad governments. It only encourages them.","1475589576081260546":"RT @KathyConWom: Please remember - people who have died from or with Covid have also died from treatment neglect - from banning of proven e…","1475561109872852992":"RT @EzraKahan: You can be vaccinated and not be immune.\n\nYou can be immune and not be vaccinated.\n\nVax passes aren't immunity passes.","1475560990527959045":"RT @EssexPR: You might not like my methods, but at least my questioning of the data is going to many many timelines.\nMore Journalists are s…","1475560896986558465":"RT @akheriaty: You are not “doing your part“ by giving up your rights.","1475560572095770624":"RT @PPRose145: Remember this 👉Thalidomide was used for 4 years for pregnant women before being pulled. You've already had 3 shots in less t…","1475034686552432640":"RT @hairymarx1: @jwahjwah @RealDeniseWelch So why didn't you maintain that reasoning prior to 2020?\nTake your time.","1475034508282023937":"RT @JamieIsherwoo13: @dodgerW12 @RealDeniseWelch I'm sorry but how dare anybody try to force the decision on an irreversible biological cha…","1475032133295091715":"RT @ArchRose90: Mrs Brown's Boys Christmas special will have hit 70 million in viewing figures, Neil Ferguson predicts.","1474362960483131392":"RT @MaajidNawaz: https://t.co/Ggt0AlLMCP","1474324440485879809":"@TKBIKES @drphilhammond I and all my family have just had blood tests confirming we have natural immunity.  T memory cells make antibodies when re-exposed.  This is not knowledge I have gained in the last two years.","1473983651847282688":"RT @JoelTory: I’m 26, healthy and double jabbed. Why is my booster more important than a GP seeing a patient with cancer symptoms?","1473982884109291522":"RT @Kateandtheboys: They cannot implement anything without our consent and our compliance, and without people turning on each other. \n\nAge…","1473982748377370631":"RT @JeffreyPeel: The government's productivity levels for lying are going through the roof. This government proves that industrial scale ly…","1473982667104337926":"RT @YardleyShooting: I ask everyone how many they know who have died of cv. Most say no one, a few say one, rarely someone says more than o…","1473982595486687247":"RT @AllisonPearson: Why is @BBCNews playing down the fact the Omicron variant is far less severe?\n It’s a sick society that only imposes ba…","1473982390179704835":"RT @CraigDvn: @toadmeister In a democracy, the public doesn't have to \"accept\" anything. In the final analysis, the people choose who makes…","1473982226291384326":"RT @CromwellStuff: Last year MPs spent over £285 billion on the nhs, yep that much! So over the past two years just short of £500 billion,…","1473982092157591559":"RT @KevinKileyCA: Gavin Newsom just announced the first \"booster mandate.\" This sets a new world record for the time between conspiracy the…","1473981747754844162":"RT @psychicsam: @northerness These experimental biotech mRnA jabs don’t give any protection. They do however cause deaths &amp; leave people wi…","1473981506288865283":"RT @steviatherton: I am advising anyone suffering under a disability and affected by yesterday’s announcement by the Executive on masks to…","1473981336482467845":"RT @EssexPR: 🚨Imperial College says Omicron is milder.\n\nThere is no justification to restrict Hospitality or anyone else.","1473981308820987913":"RT @DrCharlesL: Lots of better news on Omicron yesterday and it was all over the front pages today.\n\nProgress! Great to see.","1473981026544369669":"RT @RupertLowe10: Sturgeon and Drakeford drunk on their pandemic powers!\n\nDesperate for more and more restrictions…","1473980999818223617":"RT @garethicke: I have no doubt that the plan was to take away Christmas, but they realised they couldn't make it stick. \n\nHaving 'rules' i…","1473980948463169537":"RT @KarenJukes2: What I don’t understand is the hatred to people who refuse to take a vaccine or a test! We already being denied access to…","1473980687141191692":"RT @aoifefioaoife: Can we start calling these psychos: vaccine injury deniers ?","1473979814688305152":"RT @TVKev: Omicron: the mild variant that just didn't work out for the reliably wrong scaremongers from Sage. Never fear, they'll come up w…","1473979677052178439":"RT @RWTaylors: Mark Drakeford is destroying Wales with every announcement he makes.","1473979645653626883":"RT @Bel_B30: I could never be with a man that wore a mask. They failed at the first hurdle 🤷🏼‍♀️","1473979529140088836":"RT @TVKev: The reluctance with which so many people are greeting the cast-iron news that Omicron is a mild variant that is neither  killing…","1473979315192799235":"RT @EstherMcVey1: Labour major U turn.\n\nOnly a few days ago they wanted to lockdown longer &amp; harder with circuit breaks.\n\nJeering when some…","1473976275371020298":"RT @oflynnsocial: So the Covid situation is: a bit of a rise in hospitalisations in London (not mega), hospitalisations flat everywhere els…","1473941501923282948":"RT @TVKev: Could it be that when Boris and Sage insist they don't have all the data on Omicron what they actually mean is they do have all…","1473599795709321217":"RT @johnredwood: A Minister has replied to my question about hospitalisation rates. They say they are not using the scientific forecasts of…","1473204334099849217":"RT @RichardWellings: The vaccine passports agenda is being coordinated outside democracy by transnational institutions like the EU and WHO.…","1473204124011347969":"RT @BlueArmyFaction: Asked SAGE to do a worst case scenario for today's dog walk. Apparently I'm going to be run over twice by cars, slide…","1473203814643740675":"RT @PaulMitchell_AB: I am calling for a full Omicron lockdown...\n\nof all mainstream media, politicians and 'top doctors'.\n\nEveryone else ca…","1473203676818948099":"RT @fantasticmusic: I’m going to henceforth refer to it not as “SARScov2”, but as “US Patent 7279327” (Patented April 19th 2002).","1473203159627702279":"RT @ollysmithtravel: There are fewer Covid patients in UK hospitals (7,611) than there were at the beginning of the week (7,697), a month a…","1473202906581118978":"RT @JamesMelville: If masks, social distancing, quarantines, travel bans, avoiding loved ones, self isolations, track and trace, mass testi…","1473202745188491268":"RT @Morcia: I’m REALLY in the mood for some hardcore non-compliance, rebellion and outright contrariness against our glorious Regime and ev…","1473202549998198790":"RT @cotterill_david: There are over 850,000 registered sex offenders in the UK and they don’t have to carry a card because it violates thei…","1473202462106468352":"RT @jmyorks: @GBNEWS I work at St James in Leeds and haven't seen today figures but last weeks covid admissions were down 11% and were lowe…","1473200308847353856":"RT @emmakennytv: Why is this not BLOWING UP? What has happened to science? https://t.co/jRGa2kfw6g","1473198111292022787":"RT @JohnLalor18: I had forgotten, but I was reminded today that Princess Diana shook hands with people dying from AIDS. Funny what #COVID19…","1473197794877972481":"RT @EssexPR: We are coming, our numbers are now huge, we have MPs, Scientists, Doctors, Nurses, Professors, Civil servants, Teachers, Polic…","1473197629328826368":"RT @AnnaMinnie4: The news  coming from  South Africa that the health authorities there have decided to stop tracing +quarantining cases due…","1472870150701555714":"RT @StillMindLab: @DominiqueTaegon @DrHoenderkamp They are running out of fear tactics. people have become immune to the fear mongering and…","1472870076990767108":"RT @Murphy67Mark: @DominiqueTaegon They want everyone vaccinated so there's nothing to compare to once the problems of destroyed immune sys…","1472869708705767424":"RT @AllanNiccolls: @DominiqueTaegon Somhow ive missed Covid throughout the entire 2 years of this due to natural immunity, the ONLY ones i…","1472869635666100224":"RT @mrchrisjohn: @DominiqueTaegon https://t.co/SikfWBVApd","1472869056093032449":"RT @DDurwent: I AM 1 OF 6.4 MILLION UNVAXXED PEOPLE IN THE UK!!! \nARE YOU?? \nRETWEET AND FIND YOUR UNVAXXED FAMILY!!","1472868710432092161":"RT @NicoleLindsay76: @JamesfWells @sajidjavid This is hate speech. What a great success the vaccine is if it only works if 100% of the popu…","1472867981323558914":"RT @BevDubus: @JamesfWells @sajidjavid Incitement to hatred\n\nThe offence of incitement to hatred occurs when someone acts in a way that is…","1472867228135702530":"RT @willpg: It needed to be said. https://t.co/bzOPJE7Mr5","1472867159101652992":"RT @ollysmithtravel: UK infections:\n\nWeds: 78610\nThu: 88376\nFri: 93045\nSat: 90418\nSun: 82886 \n\nThe \"doubling every two days\" didn't last ve…","1472867146413875203":"RT @DrAdamAneevit: \"Take our vaccines or there will be consequences\"\n\nThis 'pandemic' is starting to look a bit like a protection racket.","1472867079925678082":"RT @RealDeniseWelch: I maybe wrong, but struggling to find anything in the msm about the ‘Sage only models worst case scenario to fit what…","1472557461089497097":"RT @danwootton: If Boris even thinks about succumbing to Ferguson and SAGE by locking down the country before Christmas - when 95 per cent…","1472557407167561739":"RT @AdeleJohns13: I'm unvaxxed, never tested, never had time off for a cold and haven't needed to go to hospital.  How am I am strain on th…","1472557340452958212":"RT @LeilaniDowding: I will never comply. #resist. https://t.co/GmDGIk7b4n","1472557282181496835":"RT @McGiff: Fantastic turnout at the protest today. Met so many great people, there are more of us than they want people to think…… thank y…","1472557240502652928":"RT @DPJHodges: Understand people's Omicron concerns. But we were told vaccines would remove the need for lockdowns. If that's no longer the…","1472557142112710661":"RT @MaajidNawaz: We Are Coming 🇬🇧 \n#RESIST","1472555984807673866":"RT @EssexPR: Oh my.\nExperts are starting to be allowed to speak out.\n\n“ As a Doctor, it pains me to say this, but I believe a climate of dr…","1470888429743452168":"RT @davidkurten: DESPICABLE: MPs vote by 385 to 100 to put 100,000+ doctors and nurses out of a job for choosing not to take an injection o…","1470888396432330757":"RT @johnredwood: Today Ministers will use their coalition with Labour and the SNP to push through laws many disagree with. Ministers should…","1470887651154743303":"RT @tfa4freedom: A great defence of freedom from Miriam Cates MP. Well worth a minute of your time. https://t.co/59IWUaYM0B","1470887354009333766":"RT @NeilClark66: I’m logging off for the rest of the day as what’s going on is simply too depressing for words. Let’s be honest: only a rev…","1470887231984484355":"RT @respect65: Let us say this once more: The Covid IFR is comparable to that of the flu at 0.096%. The Omicron variant is even milder. Why…","1470885567462363148":"RT @YardleyShooting: We should all be deeply suspicious now of what's going on. The Govt is tyrannical. It's used military psyop methods to…","1470885359500341256":"RT @jilicious: I’m looking for my 123,000 NHS refusenik colleagues if you’re on here! Please help me find them with a retweet. We’re strong…","1470878321340784646":"RT @louie_french: I fully support the booster rollout and I will get mine ASAP thanks to the efforts of the government, NHS, pharmacies, ar…","1470875658750500868":"RT @KazzyMints: @Keir_Starmer Voting for vaccine passports is unnecessary and is not anything to do with science! The future votes of the B…","1468216258361442312":"RT @hughosmond: 336 confirmed omicron cases in UK; none hospitalised. Not one @sajidjavid ? So can we stand down on the panic and the extra…","1465606001495842817":"RT @lensiseethrough: Despite the fact the new schools guidance states pupils are ‘strongly advised’ (not mandated) to wear masks in communa…","1464624696922710017":"RT @taz81: my mother in law who has had 2 jabs and a booster has finally seen the light! she just admitted that we have a point and can now…","1463506327959920646":"RT @mattletiss7: How many more more sports people need to collapse on the pitch before an investigation takes place 🤷🏼‍♂️","1457755880125042698":"RT @MaajidNawaz: PFIZER SCANDAL\n\nConsultant Cardiologist @DrAseemMalhotra attacks Pfizer for the “falsified data” covid vax scandal\n\n“I had…","1457325708024365056":"RT @profnfenton: Strange. The people who continually predict that 100s of thousands will die without lockdowns &amp; that 20% of the population…","1457318970244177921":"RT @Arwenstar: A brave man! Vaccine developer Nikolai Petrovsky says he’s feeling very uncomfortable about what’s happened the last 18 mont…","1457318909820944385":"RT @jeff29935001: The vaccinated are sick and dying from sudden onset of coincidental illnesses.","1457318887150739461":"RT @EssexPR: Our Government is thinking of making boosters a condition of foreign travel, that’s not science that’s politics &amp; money.\nWhy t…","1457318820071235585":"RT @djlange: Interesting that the mainstream media promotes a march for climate change but have never mentioned ANY of the huge marches in…","1455972079174574083":"RT @danjgregory: PROTECT CHILDREN’S EDUCATION\n\n👏Today 3 Nov @CommonsEd Chair @halfon4harlowMP will introduce a Bill to protect millions of…","1454755703428628480":"RT @PeterSweden7: Hundreds of thousands of people have taken to the streets all over Europe to protest for freedom for 4 months in a row.…","1454755499082141696":"RT @delbigtree: No words.","1454754667049721861":"RT @ErwanLeCorre: How do you typically react when you realize that you’ve been conned in a major way - with major long-term consequences to…","1454754276530704385":"RT @JamesMelville: Prince Charles will take a private jet to Rome to take part in the G20 conference before returning via private jet to th…","1449399223317893124":"RT @hartgroup_org: The most effective way to aid recovery would be for the Government to ensure the removal of all remaining COVID-19 restr…","1449373001082982401":"RT @johnthefocuser: @SWso155 @top1percentile The BMJ says,\n“None of the trials currently under way are designed to detect a reduction in an…","1449372779518779400":"RT @latimeralder: The Earth has been around for 4,500,000,000 years.\n\nIt's been 10C warmer. It's had 15 times the CO2 concentration.\n\nAnd l…","1449372729300377601":"RT @darrenmark69: We vote governments in to lead us, not to dictate to us.\n#NoVaccinePassportAnywhere","1449372683037253637":"RT @GSpellchecker: \"I'm about to say something that will mean you will probably want to edit the programme...you cannot change your sex\"\n\nT…","1449360422495264772":"RT @DesmondSwayne: Lord Jesus Christ, when thou comest into thy Kingdom, remember thy servant David. https://t.co/DHTfWN6RUD","1449051062636322818":"RT @michaelpbreton: Canada.\n\nLet me repeat...\n\nAt least 25,000 health care workers in the province of Quebec are refusing the injection.\n\nT…","1445436005063012355":"RT @1BJDJ: Give this legend a beep if you go past him in the London area. 😁 https://t.co/8PvVtUkt8d","1442043636917538824":"@eatsruns @JuliaHB1 What kind of ‘vaccine’ after 2 shots wears off after 6 months?  New experimental injection.  Question everything.","1442043161325576192":"@AVO8OHM @JuliaHB1 Isn’t that exactly the point of propaganda - say it ‘enough times’ and …..","1442042249701826560":"@dorians @JuliaHB1 Are you following’Boris’ science?","1437665553288663040":"@JREw1ng @GillianMcKeith But when they were dying last year of underlying health conditions, they were labelled Covid.  Convenient!","1420049340358447106":"RT @davidkurten: RESISTANCE: It is excellent to hear that many young people are rebelling against global tyranny and refusing masks, experi…","1420048710428413959":"RT @heritagepartyuk: The Heritage Party opposes a 'cashless society'. \nThere must always be an option to pay in cash at retail outlets, and…","1420046165723201543":"@RupertLowe10 @LettingFocus School pupils probably not testing in the holidays, so numbers not being artificially inflated by false positives.","1419607568012521473":"RT @TonyHinton2016: These are positive tests and not infectious cases in the main.","1419607256006549505":"RT @drscottjensen: More lockdowns, more restrictions, more erosion of rights through “passports”… you see the conversations starting among…","1419607168123293698":"RT @OffGuardian0: @BernardGyorgy @ShallBeFree7591 how long will you continue to 'take precautions' \n\nForever? \n\nlocked up, jabbed every few…","1419606104623960070":"RT @JamesDelingpole: Boris Johnson has privately admitted to all the MSM editors that he's not in charge, that he's just obeying orders. Th…","1419198336414928902":"RT @ez_dee: They used convid to cheat in an election.\nThey faked a pandemic to stop a man who was fighting to end them for good.\nThe scam e…","1419196559435128832":"RT @Ogdensnutflake: @YardleyShooting So why would the Government be looking for a supplier of over £3 billion worth of oral Anticoagulants…","1419195778988400640":"RT @sebrushworth: This is Sweden: 11 days and counting without a single covid death. The tube is packed and not a face mask in sight. https…","1410684724427825158":"@Mark_J_Harper @uksciencechief @GavinWilliamson Lemon juice gives a positive result.  Shows lft does not test for a virus.  Kids need to be with their peers and not constantly worrying about being sent home.","1408718185961070598":"RT @tarynabell: My daughter is in Asda right now and has just sent me this photo. She’s finally brave enough! 👏🏼😄\n#showyoursmile https://t.…","1404516748657897478":"RT @TiceRichard: WHITTY confirms Govt wants to vaccinate children, by saying if looks like their education likely to be disrupted then we s…","1404515610206298121":"RT @TonyHinton2016: Please retweet if you agree. All parents need to see this urgently. Thanks for everyone’s help. We can all make a diffe…","1404105853070888972":"RT @JoseSenco: We stand with you @MarcusFysh","1404105813162090505":"RT @PrisonPlanet: \"There is no way that I'll be doing any more social distancing or masks or anything like that. Whatever they say the rule…","1404105767905603589":"RT @MarcusFysh: It's time to cut the SAGE lunatics out of decision making @BorisJohnson Please get on with opening up completely, meaning n…","1404105742488059905":"RT @MarcusFysh: Crack on with life https://t.co/7X1Rt33YYX","1402375191347535873":"RT @JuliaHB1: Brits' holiday hopes dashed AGAIN as Hancock warns new variants are ‘biggest challenge’.\n\nIf you’re going to limit foreign tr…","1400142269970370563":"RT @talkRADIO: Mark Dolan: “The lockdown fanatics have had their way for 14 months and wrecked the country. We are at war with Sage and the…","1392921828478312450":"RT @Rainbowandsteel: Does anyone want what I want? Honest leaders, with integrity. Who love this country. Who prioritise its people &amp; rejec…","1390418812571377666":"RT @jasonbright16: It is currentlylegal to abort a child with #DownSyndrome up to full term of pregnancy just because of an extra chromosom…","1389149279340609536":"RT @northerness: We could see #TakeOffYourMask trending again today. \n\nPeople are angry &amp; frustrated after yesterday's comments by @Dominic…","1389145648172240897":"RT @JamesfWells: @TiceRichard @Kenneth__Morton https://t.co/GOXsLfp69n","1388893926271094793":"RT @UsforThemUK: May 1st. The countdown is on to the promised end of masks in class on 17 May. \n\nTime to let our children breathe. \n\n@Boris…","1388819421095923719":"RT @reformparty_uk: 🚨A warning about vaccine passports🚨\n\nFrom @drdavidbull https://t.co/zGLCz6VJeM","1388818293981601795":"RT @DrTeckKhong: The Alliance for Democracy and Freedom is proud of our nurses, care workers and all health professionals. \n\nVote @ADFParty…","1384772686166085639":"RT @moolie61: Mike Yeadon:\n1/ \"My message is a plea not to be fooled by the Great Lie of 2021, that “variants escape our immune defences so…","1382430038222643200":"RT @KathyConWom: Just caught up with this - please share","1382069520072912897":"@Francis_Hoar Can you bring a similar case in UK?","1380535170651029509":"@NickTriggle Masks restrict teaching and learning.  They do not stop the virus (see Danish study) and are a health hazard.  UK at population immunity of 73.4% by Monday according to UCL.  Masks damage children’s development and must be stopped.","1379697045427134464":"RT @NeilClark66: This is great news- and don’t  forget the WHO have come out against Covid-Passports too including for international travel…","1379696182700675072":"RT @JamesMelville: The US government has ruled out introducing mandatory federal Covid-19 vaccination passports, saying citizens' privacy a…","1379372866165149697":"RT @alanvibe: This is EXACTLY the kind of LEADERSHIP we need to see across ALL Sectors Please\n\n@Cinema_UK says will NOT have Covid Passport…","1379372798913748993":"RT @GillianMcKeith: Can we please divorce this government?\nAbuse should not be tolerated in any relationship. \nAnd this relationship is bec…","1379372671247454209":"RT @NeilClark66: Do we not need to be thinking about a citizens’ class action lawsuit against the UK govt &amp; Johnson &amp; Hancock personally &amp;…","1379372609834475521":"RT @MartinDaubney: February: “COVID passports are discriminatory. We are not planning to have them in the U.K.”\n\nToday: “COVID passports to…","1379371410871701506":"RT @LPerrins: I live in Britain. \nI will never, ever ‘show my papers.’\n #NoVaccinePassports","1378406894277169155":"RT @JoseSenco: @BorisJohnson What about this Boris https://t.co/OBgITLpp0l","1378397767018672128":"RT @berniespofforth: This is a pivotal moment in all of our lives. \n\nA time when we are being coerced through fear, to give in to the growi…","1370765027431608320":"@FloraBe24713480 @DebbeeHutchins1 Masks are a health hazard which do not stop the virus.","1368876691284713474":"RT @UsforThemUK: Children going back to school today but anxious about wearing masks.\n\nIf children have to wear masks, so should Government…","1363955056693903363":"RT @ClareCraigPath: That's right Boris \"clearly nonsensical\": https://t.co/6G4zJD1oP8","1363925751129640963":"RT @MattGubba: Do not forget:\n\nThe Coronavirus Act must be voted on by MPs at the end of March to remain in force.\n\nIf enough vote against…","1361983182409728000":"RT @profnfenton: 1. Our article debunking the Govt claim that \"1 in 3 people with COVID have no symptoms\" has been updated to include a new…","1350831602474098689":"RT @NeilClark66: Brits (&amp; Irish) please take note.","1350062472154259456":"RT @davidkurten: 99.7% of people who contract SARS-Cov-2 overcome it with their own immune system, &amp; those who sadly do not, have an averag…","1348339354100490240":"RT @alanhigham100: @ethansgrumps @ClareCraigPath Here's what a doctor who signs death certificates thinks.\n\nhttps://t.co/UXZt3omNHi","1343659745069117441":"@talkRADIO @nickdebois As a teacher and parent - schools must stay open.  Online lessons can never replace in class interactions.","1330539446639407105":"Asymptomatic people cannot transmit. https://t.co/bxM5LWHRhK","1327698069190828033":"Positive tests are not cases. https://t.co/nNHIrRKn1y","1307577440869416960":"PCR testing is giving such a high false positive rate , which must be acknowledged by the government.https://t.co/ok1c5starU"}